# IMPORTS

In [ ]:
import pandas as pd
import psycopg2 as pg


# COLLECT DATA

In [40]:
#credentials
#user     = '*****'
#pwd      = '*****'
#host     = '*****'
#port     = ****
#database = '*****'

In [78]:
conn = pg.connect(user=user,
                  password = pwd,
                  host = host,
                  port = port,
                  database = database)

## 1.0 SCHEMA QUERY

In [79]:
cursor = conn.cursor()

query = """ 
    SELECT nspname
    FROM pg_catalog.pg_namespace
"""

df = pd.read_sql_query(query, conn)
cursor.close()
conn.close()
df

               nspname
0             pg_toast
1            pg_temp_1
2      pg_toast_temp_1
3           pg_catalog
4   information_schema
5               public
6                pa004
7            pg_temp_4
8      pg_toast_temp_4
9                pa005
10           pg_temp_9
11     pg_toast_temp_9

## 2.0 TABLE QUERY

In [47]:
cursor = conn.cursor()

query = """ 
    SELECT tablename
    FROM pg_tables
    WHERE schemaname = 'pa004'
"""

df = pd.read_sql_query(query, conn)
cursor.close()
conn.close()

In [48]:
df

   tablename
0      users
1    vehicle
2  insurance

## 3.0 JOIN TABLES AND CREATE CSV DATAFRAME

In [60]:
cursor = conn.cursor()

query = """ 
    SELECT *
    FROM pa004.users u LEFT JOIN pa004.vehicle v ON (u.id = v.id)
                       LEFT JOIN pa004.insurance i ON (u.id = i.id ) 
    
"""

df = pd.read_sql_query(query, conn)
cursor.close()
conn.close()

In [63]:
df = df.drop(df.columns[[5,9]], axis = 1)
df.to_csv('pa004-lucaspetrods',index = False)
# Neste passo, optei por criar um arquivo csv com os dados, mesmo sabendo que nas empresas não se faz isso. 
# Fiz esta opção, pois os dados foram tirados de um banco de dados na AWS, que pertence a comunidade a qual faço parte
# (comunidade ds), e criando este arquivo posso esconder as credenciais de acesso ao bd.